// Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N. Использовать рекурсию, не использовать циклы.
 
int num1 = new Random().Next(1,10);
int num2 = new Random().Next(10,20);
Console.WriteLine("Сген. числа");

